{
    "skill_storm":{
        "background_img":"assets/images/project/skill_5.jpeg",
        "Client":"",
        "Category":"Web Development integrated with AI",
        "Services":"Product development",
        "Web":"",
        "title":"Project Description",
        "project_description": "This project is a multi-expertise platform, allowing users to host the contest to express individual skills, and within the contest, participants can communicate. Winners are rewarded with cash prizes and recognition in this community. Our project nurtures an environment of collaboration, encourages users to learn from each other, and provides a platform for them to share their expertise with the world.",
        "next_title":"Tech Stack we've used",
        "tech_desc":"This platform utilizes a comprehensive tech stack to deliver a seamless user experience. Figma is employed for designing intuitive user interfaces, ensuring a user-friendly interaction. For the front-end implementation, we rely on HTML, CSS, JavaScript, and Bootstrap, leveraging their collective power to create responsive, visually appealing web pages. On the back-end, Python with the Flask framework drives our server-side logic, enabling efficient handling of requests and data processing. MongoDB serves as our database solution, providing flexibility and scalability to accommodate diverse data types and user interactions. To facilitate secure and convenient payment transactions, we integrate Stripe into our platform. Additionally, Firebase cloud storage caters to our storage needs, enabling efficient management and access to multimedia content. Together, this robust tech stack forms the foundation of our platform, empowering users to host contests, communicate, and share expertise seamlessly",
        "tech_stack":[
            "Figma is used for UI/UX design.",
            "HTML, CSS, JS,Jquery,Ajax and Bootstrap are used for implementing the user-facing interface.",
            "Python with Flask is used to handle server-side logic and API endpoints.",
            "MongoDB is used for data storage.",
            "Stripe is integrated for handling payment transactions.",
            "Firebase cloud storage is used for storing media files.",
            "Websocket for chatting page"
        ]

    }
}